## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.example will be created
  + resource "azurerm_key_vault" "example" {
      + access_policy                 = (known after apply)
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "aatest1234"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "aatest1"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "ServiceCode" = "CDO"
          + "tag1"        = "value1"
        }
      + tenant_id                     = "c9d74090-b4e6-4b04-981d-e6757a160812"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>